{
	"modelTopology": {
		"keras_version": "2.2.4", 
		"backend": "tensorflow", 
		"model_config": {
			"class_name": "Model", "config": {
				"name": "model_1",
				"layers": [{
					"name": "sequence_input", 
					"class_name": "InputLayer", 
					"config": {
						"batch_input_shape": [null, 2000, 21], 
						"dtype": "float32", 
						"sparse": false, 
						"name": "sequence_input"},
					"inbound_nodes": []
					}, {
					"name": "encoder_conv0", 
					"class_name": "Conv1D", 
					"config": {
						"name": "encoder_conv0", 
						"trainable": true, 
						"batch_input_shape": [null, null, 2000, 21], 
						"dtype": "float32", 
						"filters": 16, "kernel_size": [3], 
						"strides": [1], 
						"padding": "same", 
						"data_format": "channels_last", 
						"dilation_rate": [1], 
						"activation": "elu", 
						"use_bias": true, 
						"kernel_initializer": {
							"class_name": "VarianceScaling", 
							"config": {
								"scale": 2.0, 
								"mode": "fan_in", 
								"distribution": "uniform", 
								"seed": null
							}
						}, 
						"bias_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"kernel_regularizer": null, 
						"bias_regularizer": null, 
						"activity_regularizer": null, 
						"kernel_constraint": null, 
						"bias_constraint": null
					}, 
					"inbound_nodes": [[["sequence_input", 0, 0, {}]]]
				}, {
					"name": "encoder_bn0", 
					"class_name": "BatchNormalization", 
					"config": {
						"name": "encoder_bn0", 
						"trainable": true, 
						"axis": -1, 
						"momentum": 0.99, 
						"epsilon": 0.001, 
						"center": true, 
						"scale": true, 
						"beta_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"gamma_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"moving_mean_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"moving_variance_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"beta_regularizer": null, 
						"gamma_regularizer": null, 
						"beta_constraint": null, 
						"gamma_constraint": null
					}, 
					"inbound_nodes": [[["encoder_conv0", 0, 0, {}]]]
				}, {
					"name": "encoder_conv1", 
					"class_name": "Conv1D", 
					"config": {
						"name": "encoder_conv1", 
						"trainable": true, 
						"filters": 24, 
						"kernel_size": [3], 
						"strides": [1], 
						"padding": "same", 
						"data_format": "channels_last", 
						"dilation_rate": [1], 
						"activation": "elu", 
						"use_bias": true, 
						"kernel_initializer": {
							"class_name": "VarianceScaling", 
							"config": {
								"scale": 2.0, 
								"mode": "fan_in", 
								"distribution": "uniform", 
								"seed": null
							}
						}, 
						"bias_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"kernel_regularizer": null, 
						"bias_regularizer": null, 
						"activity_regularizer": null, 
						"kernel_constraint": null, 
						"bias_constraint": null
					}, 
					"inbound_nodes": [[["encoder_bn0", 0, 0, {}]]]
				}, {
					"name": "encoder_bn1", 
					"class_name": "BatchNormalization", 
					"config": {
						"name": "encoder_bn1", 
						"trainable": true, 
						"axis": -1, 
						"momentum": 0.99, 
						"epsilon": 0.001, 
						"center": true, 
						"scale": true, 
						"beta_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"gamma_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"moving_mean_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"moving_variance_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"beta_regularizer": null, 
						"gamma_regularizer": null, 
						"beta_constraint": null, 
						"gamma_constraint": null
					}, 
					"inbound_nodes": [[["encoder_conv1", 0, 0, {}]]]
				}, {
					"name": "max_pooling1d_1", 
					"class_name": "MaxPooling1D", 
					"config": {
						"name": "max_pooling1d_1", 
						"trainable": true, 
						"strides": [2], 
						"pool_size": [2], 
						"padding": "valid", 
						"data_format": "channels_last"
					},
					"inbound_nodes": [[["encoder_bn1", 0, 0, {}]]]
				}, {
					"name": "encoder_conv2", 
					"class_name": "Conv1D", 
					"config": {
						"name": "encoder_conv2", 
						"trainable": true, 
						"filters": 32, 
						"kernel_size": [5], 
						"strides": [1], 
						"padding": "same", 
						"data_format": "channels_last", 
						"dilation_rate": [1], 
						"activation": "elu", 
						"use_bias": true, 
						"kernel_initializer": {
							"class_name": "VarianceScaling", 
							"config": {
								"scale": 2.0, 
								"mode": "fan_in", 
								"distribution": "uniform", 
								"seed": null
							}
						}, 
						"bias_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"kernel_regularizer": null, 
						"bias_regularizer": null, 
						"activity_regularizer": null, 
						"kernel_constraint": null, 
						"bias_constraint": null
					}, 
					"inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]
				}, {
					"name": "encoder_bn2", 
					"class_name": "BatchNormalization", 
					"config": {
						"name": "encoder_bn2", 
						"trainable": true, 
						"axis": -1, 
						"momentum": 0.99, 
						"epsilon": 0.001, 
						"center": true, 
						"scale": true, 
						"beta_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"gamma_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"moving_mean_initializer": {
							"class_name": "Zeros",
							"config": {}
						}, 
						"moving_variance_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"beta_regularizer": null,
						"gamma_regularizer": null, 
						"beta_constraint": null, 
						"gamma_constraint": null
					}, 
						"inbound_nodes": [[["encoder_conv2", 0, 0, {}]]]
					}, {
						"name": "encoder_conv3", 
						"class_name": "Conv1D", 
						"config": {
							"name": "encoder_conv3", 
							"trainable": true, 
							"filters": 48, 
							"kernel_size": [5], 
							"strides": [1], 
							"padding": "same", 
							"data_format": "channels_last", 
							"dilation_rate": [1], 
							"activation": "elu", 
							"use_bias": true, 
							"kernel_initializer": {
								"class_name": "VarianceScaling", 
								"config": {
									"scale": 2.0, 
									"mode": "fan_in", 
									"distribution": "uniform", 
									"seed": null
								}
							}, 
							"bias_initializer": {
								"class_name": "Zeros", 
								"config": {}
							}, 
							"kernel_regularizer": null, 
							"bias_regularizer": null, 
							"activity_regularizer": null, 
							"kernel_constraint": null, 
							"bias_constraint": null
						}, 
						"inbound_nodes": [[["encoder_bn2", 0, 0, {}]]]
					}, {
						"name": "encoder_bn3", 
						"class_name": "BatchNormalization", 
						"config": {
							"name": "encoder_bn3", 
							"trainable": true, 
							"axis": -1, 
							"momentum": 0.99, 
							"epsilon": 0.001, 
							"center": true, 
							"scale": true, 
							"beta_initializer": {
								"class_name": "Zeros", 
								"config": {}
							}, 
							"gamma_initializer": {
								"class_name": "Ones", 
								"config": {}
							}, 
							"moving_mean_initializer": {
								"class_name": "Zeros", 
								"config": {}
							}, "moving_variance_initializer": {
								"class_name": "Ones", 
								"config": {}
							}, 
							"beta_regularizer": null, 
							"gamma_regularizer": null, 
							"beta_constraint": null, 
							"gamma_constraint": null
						}, 
						"inbound_nodes": [[["encoder_conv3", 0, 0, {}]]]
					}, {
						"name": "max_pooling1d_2", 
						"class_name": "MaxPooling1D", 
						"config": {
							"name": "max_pooling1d_2", 
							"trainable": true, 
							"strides": [2], 
							"pool_size": [2], 
							"padding": "valid", 
							"data_format": "channels_last"
						}, 
						"inbound_nodes": [[["encoder_bn3", 0, 0, {}]]]
					}, {
						"name": "encoder_conv4", 
						"class_name": "Conv1D", 
						"config": {
							"name": "encoder_conv4", 
							"trainable": true, 
							"filters": 64, 
							"kernel_size": [7], 
							"strides": [1], 
							"padding": "same", 
							"data_format": "channels_last", 
							"dilation_rate": [1], 
							"activation": "elu", 
							"use_bias": true, 
							"kernel_initializer": {
								"class_name": "VarianceScaling", 
								"config": {
									"scale": 2.0, 
									"mode": "fan_in", 
									"distribution": "uniform", 
									"seed": null
								}
							}, 
							"bias_initializer": {
								"class_name": "Zeros", 
								"config": {}
							}, 
						"kernel_regularizer": null, 
						"bias_regularizer": null, 
						"activity_regularizer": null, 
						"kernel_constraint": null, 
						"bias_constraint": null
					}, 
					"inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]
				}, {
					"name": "encoder_bn4", 
					"class_name": "BatchNormalization", 
					"config": {
						"name": "encoder_bn4", 
						"trainable": true, 
						"axis": -1, 
						"momentum": 0.99, 
						"epsilon": 0.001, 
						"center": true, 
						"scale": true, 
						"beta_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"gamma_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
						"moving_mean_initializer": {
							"class_name": "Zeros", 
							"config": {}
						}, 
						"moving_variance_initializer": {
							"class_name": "Ones", 
							"config": {}
						}, 
					"beta_regularizer": null, 
					"gamma_regularizer": null, 
					"beta_constraint": null, 
					"gamma_constraint": null
				}, 
				"inbound_nodes": [[["encoder_conv4", 0, 0, {}]]]
			}, {
				"name": "encoder_conv5", 
				"class_name": "Conv1D", 
				"config": {
					"name": "encoder_conv5", 
					"trainable": true, 
					"filters": 96, 
					"kernel_size": [7], 
					"strides": [1], 
					"padding": "same", 
					"data_format": "channels_last", 
					"dilation_rate": [1], 
					"activation": "elu", 
					"use_bias": true, 
					"kernel_initializer": {
						"class_name": "VarianceScaling", 
						"config": {
							"scale": 2.0, 
							"mode": "fan_in", 
							"distribution": "uniform", 
							"seed": null
						}
					},
					"bias_initializer": {
						"class_name": "Zeros", 
						"config": {}
					}, 
					"kernel_regularizer": null, 
					"bias_regularizer": null, 
					"activity_regularizer": null,
					"kernel_constraint": null, 
					"bias_constraint": null
				}, 
				"inbound_nodes": [[["encoder_bn4", 0, 0, {}]]]
			}, {
				"name": "encoder_bn5", 
				"class_name": "BatchNormalization", 
				"config": {
					"name": "encoder_bn5", 
					"trainable": true, 
					"axis": -1, 
					"momentum": 0.99, 
					"epsilon": 0.001, 
					"center": true, 
					"scale": true, 
					"beta_initializer": {
						"class_name": "Zeros", 
						"config": {}
					}, 
					"gamma_initializer": {
						"class_name": "Ones", 
						"config": {}
					}, 
					"moving_mean_initializer": {
						"class_name": "Zeros", 
						"config": {}
					}, 
					"moving_variance_initializer": {
						"class_name": "Ones", 
						"config": {}
					}, 
					"beta_regularizer": null, 
					"gamma_regularizer": null, 
					"beta_constraint": null, 
					"gamma_constraint": null
				}, 
				"inbound_nodes": [[["encoder_conv5", 0, 0, {}]]]
			}, {
				"name": "max_pooling1d_3", 
				"class_name": "MaxPooling1D", 
				"config": {
				"name": "max_pooling1d_3", 
				"trainable": true, 
				"strides": [2], 
				"pool_size": [2], 
				"padding": "valid", 
				"data_format": "channels_last"
			}, 
			"inbound_nodes": [[["encoder_bn5", 0, 0, {}]]]
		}, {
			"name": "flatten_1", 
			"class_name": "Flatten", 
			"config": {
				"name": "flatten_1", 
				"trainable": true, 
				"data_format": "channels_last"
			}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]
		}, {
			"name": "encoder_aff0", 
			"class_name": "Dense", 
			"config": {
				"name": "encoder_aff0", 
				"trainable": true, 
				"units": 2048, 
				"activation": "elu", 
				"use_bias": true, 
				"kernel_initializer": {
					"class_name": "VarianceScaling", 
					"config": {
						"scale": 2.0, 
						"mode": "fan_in", 
						"distribution": "uniform", 
						"seed": null
					}
				}, 
				"bias_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"kernel_regularizer": null, 
				"bias_regularizer": null,
				"activity_regularizer": null, 
				"kernel_constraint": null, 
				"bias_constraint": null
			}, 
			"inbound_nodes": [[["flatten_1", 0, 0, {}]]]
		}, {
			"name": "encoder_bn6", 
			"class_name": "BatchNormalization", 
			"config": {
				"name": "encoder_bn6", 
				"trainable": true, 
				"axis": -1, 
				"momentum": 0.99, 
				"epsilon": 0.001, 
				"center": true, 
				"scale": true, 
				"beta_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"gamma_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"moving_mean_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"moving_variance_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"beta_regularizer": null, 
				"gamma_regularizer": null, 
				"beta_constraint": null, 
				"gamma_constraint": null
			}, 
			"inbound_nodes": [[["encoder_aff0", 0, 0, {}]]]
		}, {
			"name": "encoder_aff1", 
			"class_name": "Dense", 
			"config": {
				"name": "encoder_aff1", 
				"trainable": true, 
				"units": 1024, 
				"activation": "elu", 
				"use_bias": true, 
				"kernel_initializer": {
						"class_name": "VarianceScaling", 
						"config": {
						"scale": 2.0, 
						"mode": "fan_in", 
						"distribution": "uniform", 
						"seed": null
					}
				}, 
				"bias_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"kernel_regularizer": null, 
				"bias_regularizer": null, 
				"activity_regularizer": null, 
				"kernel_constraint": null, 
				"bias_constraint": null
			}, 
			"inbound_nodes": [[["encoder_bn6", 0, 0, {}]]]
		}, {
			"name": "encoder_bn7", 
			"class_name": "BatchNormalization", 
			"config": {
				"name": "encoder_bn7", 
				"trainable": true, 
				"axis": -1, 
				"momentum": 0.99, 
				"epsilon": 0.001, 
				"center": true, 
				"scale": true, 
				"beta_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"gamma_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"moving_mean_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"moving_variance_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"beta_regularizer": null, 
				"gamma_regularizer": null, 
				"beta_constraint": null, 
				"gamma_constraint": null
			}, 
			"inbound_nodes": [[["encoder_aff1", 0, 0, {}]]]
		}, {
			"name": "encoder_aff2", 
			"class_name": "Dense", 
			"config": {
				"name": "encoder_aff2", 
				"trainable": true, 
				"units": 512, 
				"activation": "elu", 
				"use_bias": true, 
				"kernel_initializer": {
					"class_name": "VarianceScaling", 
					"config": {
						"scale": 2.0, 
						"mode": "fan_in", 
						"distribution": "uniform", 
						"seed": null
					}
				}, 
				"bias_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"kernel_regularizer": null, 
				"bias_regularizer": null, 
				"activity_regularizer": null, 
				"kernel_constraint": null, 
				"bias_constraint": null
			}, 
			"inbound_nodes": [[["encoder_bn7", 0, 0, {}]]]
		}, {
			"name": "encoder_bn8", 
			"class_name": "BatchNormalization", 
			"config": {
				"name": "encoder_bn8", 
				"trainable": true, 
				"axis": -1, 
				"momentum": 0.99, 
				"epsilon": 0.001, 
				"center": true, "scale": true, 
				"beta_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"gamma_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"moving_mean_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"moving_variance_initializer": {
					"class_name": "Ones", 
					"config": {}
				}, 
				"beta_regularizer": null, 
				"gamma_regularizer": null, 
				"beta_constraint": null, 
				"gamma_constraint": null
			}, 
			"inbound_nodes": [[["encoder_aff2", 0, 0, {}]]]
		}, {
			"name": "encoder_aff3", 
			"class_name": "Dense", 
			"config": {
				"name": "encoder_aff3", 
				"trainable": true, 
				"units": 256, 
				"activation": "elu", 
				"use_bias": true, 
				"kernel_initializer": {
					"class_name": "VarianceScaling", 
					"config": {
						"scale": 2.0, 
						"mode": "fan_in", 
						"distribution": "uniform", 
						"seed": null
					}
				}, 
				"bias_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
			"kernel_regularizer": null, 
			"bias_regularizer": null, 
			"activity_regularizer": null, 
			"kernel_constraint": null, 
			"bias_constraint": null
		}, 
		"inbound_nodes": [[["encoder_bn8", 0, 0, {}]]]
	}, {
		"name": "embedding", 
		"class_name": "BatchNormalization", 
		"config": {
			"name": "embedding", 
			"trainable": true, 
			"axis": -1, 
			"momentum": 0.99, 
			"epsilon": 0.001, 
			"center": true, 
			"scale": true, 
			"beta_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"gamma_initializer": {
				"class_name": "Ones", 
				"config": {}
			},
			 "moving_mean_initializer": {
			 	"class_name": "Zeros", 
			 	"config": {}
			 }, 
			 "moving_variance_initializer": {
			 	"class_name": "Ones", 
			 	"config": {}
			 }, 
			"beta_regularizer": null, 
			"gamma_regularizer": null, 
			"beta_constraint": null, 
			"gamma_constraint": null
		}, 
		"inbound_nodes": [[["encoder_aff3", 0, 0, {}]]]
	}, {
		"name": "embed_auto0", 
		"class_name": "Dense", 
		"config": {
			"name": "embed_auto0", 
			"trainable": true, 
			"units": 128, 
			"activation": "elu", 
			"use_bias": true, 
			"kernel_initializer": {
				"class_name": "VarianceScaling", 
				"config": {
					"scale": 2.0, 
					"mode": "fan_in", 
					"distribution": "uniform", 
					"seed": null
				}
			}, 
			"bias_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"kernel_regularizer": null, 
			"bias_regularizer": null, 
			"activity_regularizer": null, 
			"kernel_constraint": null, 
			"bias_constraint": null
		}, 
		"inbound_nodes": [[["embedding", 0, 0, {}]]]
	}, {
		"name": "embed_auto_bn0", 
		"class_name": "BatchNormalization", 
		"config": {
			"name": "embed_auto_bn0", 
			"trainable": true, 
			"axis": -1, "momentum": 0.99, 
			"epsilon": 0.001, 
			"center": true, 
			"scale": true, 
			"beta_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"gamma_initializer": {
				"class_name": "Ones", 
				"config": {}
			}, 
			"moving_mean_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"moving_variance_initializer": {
				"class_name": "Ones", 
				"config": {}
			}, 
			"beta_regularizer": null, 
			"gamma_regularizer": null, 
			"beta_constraint": null, 
			"gamma_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto0", 0, 0, {}]]]
	}, {
		"name": "embed_auto1", 
		"class_name": "Dense", 
		"config": {
			"name": "embed_auto1", 
			"trainable": true, 
			"units": 64, 
			"activation": "elu", 
			"use_bias": true, 
			"kernel_initializer": {
				"class_name": "VarianceScaling", 
				"config": {
					"scale": 2.0, 
					"mode": "fan_in", 
					"distribution": "uniform", 
					"seed": null
				}
			}, 
			"bias_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"kernel_regularizer": null, 
			"bias_regularizer": null, 
			"activity_regularizer": null, 
			"kernel_constraint": null, 
			"bias_constraint": null
		}, "inbound_nodes": [[["embed_auto_bn0", 0, 0, {}]]]
	}, {
		"name": "embed_auto_bn1", 
		"class_name": "BatchNormalization", 
		"config": {
			"name": "embed_auto_bn1", 
			"trainable": true, 
			"axis": -1, 
			"momentum": 0.99, 
			"epsilon": 0.001, 
			"center": true, 
			"scale": true, 
			"beta_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"gamma_initializer": {"class_name": "Ones", "config": {}}, 
			"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 
			"moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
			"beta_regularizer": null, 
			"gamma_regularizer": null, 
			"beta_constraint": null, 
			"gamma_constraint": null
		}, "inbound_nodes": [[["embed_auto1", 0, 0, {}]]]
	}, {
		"name": "embed_auto2", 
		"class_name": "Dense", 
		"config": {
			"name": "embed_auto2", 
			"trainable": true, 
			"units": 32, 
			"activation": "elu", 
			"use_bias": true, 
			"kernel_initializer": {
				"class_name": "VarianceScaling", 
				"config": {
					"scale": 2.0, 
					"mode": "fan_in", 
					"distribution": "uniform", 
					"seed": null
				}
			}, 
			"bias_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"kernel_regularizer": null, 
			"bias_regularizer": null, 
			"activity_regularizer": null, 
			"kernel_constraint": null, 
			"bias_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto_bn1", 0, 0, {}]]]
	}, {
		"name": "embed_auto_bn2", 
		"class_name": "BatchNormalization", 
		"config": {
			"name": "embed_auto_bn2", 
			"trainable": true, 
			"axis": -1, 
			"momentum": 0.99, 
			"epsilon": 0.001, 
			"center": true, 
			"scale": true, 
			"beta_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"gamma_initializer": {"class_name": "Ones", "config": {}}, 
			"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 
			"moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
			"beta_regularizer": null, 
			"gamma_regularizer": null, 
			"beta_constraint": null, 
			"gamma_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto2", 0, 0, {}]]]
	}, {
		"name": "embed_auto3", "class_name": "Dense", "config": {
			"name": "embed_auto3", 
			"trainable": true, 
			"units": 16, 
			"activation": "elu", 
			"use_bias": true, 
			"kernel_initializer": {
				"class_name": "VarianceScaling", "config": {
					"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null
				}
			}, 
			"bias_initializer": {
				"class_name": "Zeros", 
				"config": {}
			}, 
			"kernel_regularizer": null, 
			"bias_regularizer": null, 
			"activity_regularizer": null, 
			"kernel_constraint": null, 
			"bias_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto_bn2", 0, 0, {}]]]
	}, {
		"name": "embed_auto_bn3", "class_name": "BatchNormalization", "config": {
			"name": "embed_auto_bn3", "trainable": true, "axis": -1, 
			"momentum": 0.99, "epsilon": 0.001, "center": true, 
			"scale": true, "beta_initializer": {
				"class_name": "Zeros", "config": {}
			}, 
			"gamma_initializer": {
				"class_name": "Ones", 
				"config": {}
			}, 
			"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 
			"moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
			"beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto3", 0, 0, {}]]]
	}, {
		"name": "embed_auto4", "class_name": "Dense", "config": {
			"name": "embed_auto4", "trainable": true, "units": 8, "activation": "elu", 
			"use_bias": true, "kernel_initializer": {
				"class_name": "VarianceScaling", "config": {
					"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}
				}, 
				"bias_initializer": {
					"class_name": "Zeros", 
					"config": {}
				}, 
				"kernel_regularizer": null, 
				"bias_regularizer": null,
				"activity_regularizer": null, 
				"kernel_constraint": null, 
				"bias_constraint": null
			}, 
			"inbound_nodes": [[["embed_auto_bn3", 0, 0, {}]]]
		}, {
			"name": "embed_auto_bn4", "class_name": "BatchNormalization", "config": {
				"name": "embed_auto_bn4", "trainable": true, "axis": -1, "momentum": 0.99, 
				"epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {
					"class_name": "Zeros", "config": {}
				}, 
				"gamma_initializer": {
					"class_name": "Ones", "config": {}
				}, 
				"moving_mean_initializer": {
					"class_name": "Zeros", "config": {}
				}, 
				"moving_variance_initializer": {
					"class_name": "Ones", "config": {}
				}, 
			"beta_regularizer": null, "gamma_regularizer": null, 
			"beta_constraint": null, "gamma_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto4", 0, 0, {}]]]
	}, {
		"name": "embed_auto5", "class_name": "Dense", "config": {
			"name": "embed_auto5", "trainable": true, "units": 3, 
			"activation": "elu", "use_bias": true, "kernel_initializer": {
				"class_name": "VarianceScaling", "config": {
				"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null
				}
			}, 
		"bias_initializer": {
				"class_name": "Zeros", "config": {}
			}, 
			"kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, 
			"kernel_constraint": null, "bias_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto_bn4", 0, 0, {}]]]
	}, {
		"name": "eauto3d", "class_name": "BatchNormalization", "config": {
			"name": "eauto3d", "trainable": true, "axis": -1, "momentum": 0.99, 
			"epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {
				"class_name": "Zeros", "config": {}
			}, 
			"gamma_initializer": {
				"class_name": "Ones", "config": {}
			}, 
			"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, 
			"moving_variance_initializer": {"class_name": "Ones", "config": {}}, 
			"beta_regularizer": null,
			"gamma_regularizer": null,
			"beta_constraint": null,
			"gamma_constraint": null
		}, 
		"inbound_nodes": [[["embed_auto5", 0, 0, {}]]]
	}], 
	"input_layers": [["sequence_input", 0, 0]], 
	"output_layers": [["embed_auto_bn4", 0, 0], 
	["eauto3d", 0, 0]]
}
}
}, 
"weightsManifest": [{
	"paths": ["group1-shard1of50", "group1-shard2of50", "group1-shard3of50", "group1-shard4of50", "group1-shard5of50", "group1-shard6of50", "group1-shard7of50", "group1-shard8of50", "group1-shard9of50", "group1-shard10of50", "group1-shard11of50", "group1-shard12of50", "group1-shard13of50", "group1-shard14of50", "group1-shard15of50", "group1-shard16of50", "group1-shard17of50", "group1-shard18of50", "group1-shard19of50", "group1-shard20of50", "group1-shard21of50", "group1-shard22of50", "group1-shard23of50", "group1-shard24of50", "group1-shard25of50", "group1-shard26of50", "group1-shard27of50", "group1-shard28of50", "group1-shard29of50", "group1-shard30of50", "group1-shard31of50", "group1-shard32of50", "group1-shard33of50", "group1-shard34of50", "group1-shard35of50", "group1-shard36of50", "group1-shard37of50", "group1-shard38of50", "group1-shard39of50", "group1-shard40of50", "group1-shard41of50", "group1-shard42of50", "group1-shard43of50", "group1-shard44of50", "group1-shard45of50", "group1-shard46of50", "group1-shard47of50", "group1-shard48of50", "group1-shard49of50", "group1-shard50of50"], 
	"weights": [{"name": "eauto3d/gamma", "shape": [3], "dtype": "float32"}, {"name": "eauto3d/beta", "shape": [3], "dtype": "float32"}, {"name": "eauto3d/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "eauto3d/moving_variance", "shape": [3], "dtype": "float32"}, {"name": "embed_auto0/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "embed_auto0/bias", "shape": [128], "dtype": "float32"}, {"name": "embed_auto1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "embed_auto1/bias", "shape": [64], "dtype": "float32"}, {"name": "embed_auto2/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "embed_auto2/bias", "shape": [32], "dtype": "float32"}, {"name": "embed_auto3/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "embed_auto3/bias", "shape": [16], "dtype": "float32"}, {"name": "embed_auto4/kernel", "shape": [16, 8], "dtype": "float32"}, {"name": "embed_auto4/bias", "shape": [8], "dtype": "float32"}, {"name": "embed_auto5/kernel", "shape": [8, 3], "dtype": "float32"}, {"name": "embed_auto5/bias", "shape": [3], "dtype": "float32"}, {"name": "embed_auto_bn0/gamma", "shape": [128], "dtype": "float32"}, {"name": "embed_auto_bn0/beta", "shape": [128], "dtype": "float32"}, {"name": "embed_auto_bn0/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "embed_auto_bn0/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "embed_auto_bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "embed_auto_bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "embed_auto_bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "embed_auto_bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "embed_auto_bn2/gamma", "shape": [32], "dtype": "float32"}, {"name": "embed_auto_bn2/beta", "shape": [32], "dtype": "float32"}, {"name": "embed_auto_bn2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "embed_auto_bn2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "embed_auto_bn3/gamma", "shape": [16], "dtype": "float32"}, {"name": "embed_auto_bn3/beta", "shape": [16], "dtype": "float32"}, {"name": "embed_auto_bn3/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "embed_auto_bn3/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "embed_auto_bn4/gamma", "shape": [8], "dtype": "float32"}, {"name": "embed_auto_bn4/beta", "shape": [8], "dtype": "float32"}, {"name": "embed_auto_bn4/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "embed_auto_bn4/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "embedding/gamma", "shape": [256], "dtype": "float32"}, {"name": "embedding/beta", "shape": [256], "dtype": "float32"}, {"name": "embedding/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "embedding/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "encoder_aff0/kernel", "shape": [24000, 2048], "dtype": "float32"}, {"name": "encoder_aff0/bias", "shape": [2048], "dtype": "float32"}, {"name": "encoder_aff1/kernel", "shape": [2048, 1024], "dtype": "float32"}, {"name": "encoder_aff1/bias", "shape": [1024], "dtype": "float32"}, {"name": "encoder_aff2/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "encoder_aff2/bias", "shape": [512], "dtype": "float32"}, {"name": "encoder_aff3/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "encoder_aff3/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder_bn0/gamma", "shape": [16], "dtype": "float32"}, {"name": "encoder_bn0/beta", "shape": [16], "dtype": "float32"}, {"name": "encoder_bn0/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "encoder_bn0/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "encoder_bn1/gamma", "shape": [24], "dtype": "float32"}, {"name": "encoder_bn1/beta", "shape": [24], "dtype": "float32"}, {"name": "encoder_bn1/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "encoder_bn1/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "encoder_bn2/gamma", "shape": [32], "dtype": "float32"}, {"name": "encoder_bn2/beta", "shape": [32], "dtype": "float32"}, {"name": "encoder_bn2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "encoder_bn2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "encoder_bn3/gamma", "shape": [48], "dtype": "float32"}, {"name": "encoder_bn3/beta", "shape": [48], "dtype": "float32"}, {"name": "encoder_bn3/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "encoder_bn3/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "encoder_bn4/gamma", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn4/beta", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "encoder_bn5/gamma", "shape": [96], "dtype": "float32"}, {"name": "encoder_bn5/beta", "shape": [96], "dtype": "float32"}, {"name": "encoder_bn5/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "encoder_bn5/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "encoder_bn6/gamma", "shape": [2048], "dtype": "float32"}, {"name": "encoder_bn6/beta", "shape": [2048], "dtype": "float32"}, {"name": "encoder_bn6/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "encoder_bn6/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "encoder_bn7/gamma", "shape": [1024], "dtype": "float32"}, {"name": "encoder_bn7/beta", "shape": [1024], "dtype": "float32"}, {"name": "encoder_bn7/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "encoder_bn7/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "encoder_bn8/gamma", "shape": [512], "dtype": "float32"}, {"name": "encoder_bn8/beta", "shape": [512], "dtype": "float32"}, {"name": "encoder_bn8/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "encoder_bn8/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "encoder_conv0/kernel", "shape": [3, 21, 16], "dtype": "float32"}, {"name": "encoder_conv0/bias", "shape": [16], "dtype": "float32"}, {"name": "encoder_conv1/kernel", "shape": [3, 16, 24], "dtype": "float32"}, {"name": "encoder_conv1/bias", "shape": [24], "dtype": "float32"}, {"name": "encoder_conv2/kernel", "shape": [5, 24, 32], "dtype": "float32"}, {"name": "encoder_conv2/bias", "shape": [32], "dtype": "float32"}, {"name": "encoder_conv3/kernel", "shape": [5, 32, 48], "dtype": "float32"}, {"name": "encoder_conv3/bias", "shape": [48], "dtype": "float32"}, {"name": "encoder_conv4/kernel", "shape": [7, 48, 64], "dtype": "float32"}, {"name": "encoder_conv4/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder_conv5/kernel", "shape": [7, 64, 96], "dtype": "float32"}, {"name": "encoder_conv5/bias", "shape": [96], "dtype": "float32"}]}]}



















